Documents/НачислениеЗаработнойПлаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеЗаработнойПлаты</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочихДнейВМесяце</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическиОтработано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Оклады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Оклады</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОклада</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НачислениеЗаработнойПлаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗПОкладПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	РаботаСДокументами.РасчетНдфл(СТЧ);
	РаботаСДокументами.РасчетЗп(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗПРабочихДнейВМесяцеПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	РаботаСДокументами.РасчетНдфл(СТЧ);
	РаботаСДокументами.РасчетЗп(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗПФактическиОтработаноПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	РаботаСДокументами.РасчетНдфл(СТЧ);
	РаботаСДокументами.РасчетЗп(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗППремияПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	РаботаСДокументами.РасчетНдфл(СТЧ);
	РаботаСДокументами.РасчетЗп(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗПНДФЛПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	РаботаСДокументами.РасчетЗп(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗПСотрудникПриИзменении(Элемент)
	СТЧ = Элементы.ЗП.ТекущиеДанные;
	СТЧ.Оклад = РаботаСоСправочниками.Оклад(Объект.Дата, СТЧ.Сотрудник);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Дата = ТекущаяДата();
	Объект.ДатаНачалаПериода = НачалоДня (НачалоМесяца (Объект.Дата));
	Объект.ДатаОкончаниеПериода = КонецДня (КонецМесяца (Объект.Дата));
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТабличнуюЧасть()
Запрос = Новый Запрос;
      Запрос.Текст =
	  "ВЫБРАТЬ
	  |	Оклады.Сотрудник КАК Сотрудник,
	  |	Оклады.Оклад КАК Оклад
	  |ИЗ
	  |	РегистрСведений.Оклады КАК Оклады";
    РезультатЗапроса = Запрос.Выполнить().Выгрузить();
    
	Для каждого Стр из РезультатЗапроса Цикл
        НоваяСтрока = Объект.ЗП.Добавить();
        НоваяСтрока.Сотрудник = Стр.Сотрудник;
		НоваяСтрока.Оклад = Стр.Оклад;
    КонецЦикла
КонецПроцедуры
